import an1Img from '../images/Cards/an1.png';
import s1 from '../images/stuff/s1.png';
import s2 from '../images/stuff/s2.jpg';
import s3 from '../images/stuff/s3.jpg';
import s4 from '../images/stuff/s4.jpg';
import s5 from '../images/stuff/s5.jpg';
import s6 from '../images/stuff/s6.jpg';


/**
 * @author Stavros Lamprinos [stalab at linuxmail.org] on 13/1/2021.
 */

const staticContent = [
    {
        header: `Εισαγωγή`,
        content: `Το απόρρητο των επισκεπτών του ιστοτόπου μας, είναι πολύ σημαντικό για εμάς και είμαστε αφοσιωμένοι στην προστασία του. Η πολιτική μας εξηγεί πως θα χρησιμοποιήσουμε τις προσωπικές σας πληροφορίες.
                  Η συναίνεση σας στη χρήση των cookies σε συμφωνία με τους όρους της πολιτικής μας κατά την πρώτη σας επίσκεψη στον ιστότοπο, μας επιτρέπει την χρήση cookies κάθε φορά που επισκέπτεστε τον ιστότοπο μας.`
    },
    {
        header: `Εύσημα`,
        content: `Αυτό το έγγραφο δημιουργήθηκε με την χρήση προτύπου από την SEQ Legal (seqlegal.com)`
    },
    {
        header: `Συλλογή προσωπικών πληροφοριών`,
        content: `Οι παρακάτω τύποι προσωπικών πληροφοριών μπορούν να συλλεγούν, να αποθηκευτούν και να χρησιμοποιηθούν:

                Πληροφορίες σχετικές με τον υπολογιστή σας μεταξύ των οποίων η διεύθυνση IP σας, η γεωγραφική σας τοποθεσία ο τύπος και η έκδοση του περιηγητή σας και το λειτουργικό σας σύστημα.
                Πληροφορίες σχετικά με τις επισκέψεις σας και τη χρήση του ιστοτόπου περιλαμβάνοντας την εξωτερική πηγή, τη διάρκεια της επίσκεψης, της προβολές σελίδων και τη διαδρομή πλοήγησης στον ιστότοπο;
                Πληροφορίες όπως η διεύθυνση email σας, την οποία εισάγετε κατά την εγγραφή στον ιστότοπο.
                Πληροφορίες που εισάγετε κατά τη δημιουργία του προφίλ σας στον ιστότοπο μας—για παράδειγμα, το όνομα σας, οι φωτογραφίες προφίλ, το φύλο, η ημερομηνία γέννησης, η προσωπική σας κατάσταση, τα ενδιαφέροντα και τα χόμπι σας, πληροφορίες σχετικά με την εκπαίδευση σας και πληροφορίες σχετικά με την απασχόληση σας.
                Πληροφορίες, όπως το όνομα και το email σας, τις οποίες εισάγετε κατά την ρύθμιση των συνδρομών σας και για την αποστολή των emails και/η των ενημερωτικών δελτίων.
                Πληροφορίες που εισάγετε κατά τη χρήση υπηρεσιών στον ιστότοπο μας.
                Πληροφορίες που προκύπτουν κατά τη χρήση του ιστότοπου, όπως πότε, πόσο συχνά και κάτω από ποιες συνθήκες το χρησιμοποιείτε.
                Πληροφορίες σχετικές με τις αγορές σας, τις υπηρεσίες που χρησιμοποιείτε και τις συναλλαγές που κάνετε στον ιστότοπο, οι οποίες περιλαμβάνουν το όνομα, τη διεύθυνση, τον τηλεφωνικά σας αριθμό, τη διεύθυνση του email σας και της πληροφορίες της πιστωτικής σας κάρτας.
                Πληροφορίες που κοινοποιείτε στον ιστότοπο με την πρόθεση της δημοσίευσης στο διαδίκτυο, οι οποίες περιλαμβάνουν το όνομα χρήστη σας τις πληροφορίες προφίλ σας και το περιεχόμενο των δημοσιεύσεών σας.
                Πληροφορίες που περιέχονται σε οποιαδήποτε επικοινωνία σας με εμάς μέσω email ή μέσω του ιστοτόπου, περιλαμβάνοντας το περιεχόμενο επικοινωνίας και τα μεταδεδομένα (metadata).
                Οποιαδήποτε άλλη προσωπική πληροφορία μας στέλνετε.
                Προτού αποκαλύψετε οποιαδήποτε προσωπικές πληροφορίες κάποιου τρίτου ατόμου, θα πρέπει να έχετε τη συγκατάθεση αυτού του ατόμου σχετικά `
    },
    {
        header: `Διεθνείς μεταφορές δεδομένων`,
        content: `Οι πληροφορίες που συλλέγουμε μπορεί να αποθηκευτούν να επεξεργαστούν και να μετακινηθούν μεταξύ οποιωνδήποτε χωρών στις οποίες λειτουργούμε έτσι ώστε να μπορούμε να χρησιμοποιήσουμε σύμφωνα με την παρούσα πολιτική.
                Οι πληροφορίες που συλλέγουμε μπορούν να μεταφερθούν στις ακόλουθες χώρες που δεν διαθέτουν αντίστοιχη νομοθεσία προστασίας προσωπικών δεδομένων με αυτή που εφαρμόζεται στην Ευρωπαϊκή Οικονομική Περιοχή: οι ΗΠΑ, η Ρωσία η Ιαπωνία η Κίνα και η Ινδία.
                Οι προσωπικές πληροφορίες που δημοσιεύετε στον ιστότοπο μας ή υποβάλλετε προς δημοσίευση στον ιστότοπο μας, δύνανται είναι διαθέσιμες μέσω διαδικτύου σε όλο τον κόσμο. Δεν μπορούμε να αποτρέψουμε τη χρήση ή τη λανθασμένη χρήση τέτοιων πληροφοριών από τρίτους.`
    },
    {
        header: `Τρίτοι ιστότοποι`,
        content: `Ο ιστότοπος μας περιλαμβάνει υπερσυνδέσμους σε, και πληροφορίες από, τρίτους ιστότοπους. Δεν μπορούμε να ελέγξουμε και δεν φέρουμε ευθύνη για τις πολιτικές προστασίας και της πρακτικές τρίτων μερών.`
    },
    {
        header: `Ενημέρωση πληροφοριών`,
        content: `Παρακαλώ ενημερώστε μας αν οι πληροφορίες που έχουμε για εσάς χρειάζονται ενημέρωση ή διόρθωση.`
    },
];


const terms = {
    title: 'Όροι Χρήσης',
    description: 'Η εφαρμογή κατασκευάστηκε στο πλαίσιο εκπώνησης γραπτής εργασίας για την ΘΕ ΠΛΗ 23 του ' +
        'Ανοιχτού Ελληνικού Πανεπιστημίου. Ως εκ τούτου, το ΠΜΣ, το προσωπικό, οι ανακοινώσεις και τα μαθήματα ' +
        'που αναγράφονται είναι προϊόν φαντασίας και δεν έχουν καμία σχέση με την πραγματικότητα.'
}

const announce = [
    {
        id: 'an1',
        img: an1Img,
        alt: 'Image with a post',
        title: 'Εγγραφές Χειμερινού Εξαμήνου 2021',
        description: 'Σας γνωρίζουμε ότι αναρτήθηκε η συμπληρωματική  προκήρυξη των αιτήσεων για' +
            ' να αιτήσεις φοιτητών για Σπουδές και πρακτική Άσκηση για το χειμερινό εξάμηνο του Ακ. Έτους 2020-2021.',
        fullPost: 'Ανακοινώνεται στους επιτυχόντεςτου ΠΜΣ «ΠΛΗΡΟΦΟΡΙΑΚΑ ΣΥΣΤΗΜΑΤΑ» ότι οι εγγραφές ' +
            'για το Β’ εξάμηνο ακαδημαϊκού έτους 2020-21 θα πραγματοποιηθούν με ηλεκτρονική υποβολήτων  δικαιολογητικών' +
            '  που  απαιτούνται,  στο email της  Γραμματείας  του  Τμήματος, από Δευτέρα 18 έως και Παρασκευή 29' +
            ' Ιανουαρίου 2021 με θέμα αποστολής : «ΕΓΓΡΑΦΕΣ Β’ ΕΞΑΜΗΝΟΥ»'
    },
    {
        id: 'an2',
        img: an1Img,
        alt: 'Image with a post',
        title: 'Ωρολόγιο Πρόγραμμα Διδασκαλίας, Έναρξη και Τρόπος Διεξαγωγής Μαθημάτων Β’ Εξαμήνου ακαδ. έτους 2020-21',
        description: 'Σας ενημερώνουμε ότι η ημερομηνία έναρξης των μαθημάτων, στο ΠΜΣ “Πληροφοριακά Συστήματα”' +
            ' για το Β’ εξάμηνο, είναι η Δευτέρα 1 Μαρτίου 2021.',
        fullPost: 'Σας ενημερώνουμε ότι η ημερομηνία έναρξης των μαθημάτων, στο ΠΜΣ “Πληροφοριακά Συστήματα”' +
            ' για το Β’ εξάμηνο, είναι η Δευτέρα 1 Μαρτίου 2021. Τα μαθήματα μέχρι νεωτέρας θα πραγματοποιούνται' +
            ' εξ αποστάσεως.'
    },
    {
        id: 'an3',
        img: an1Img,
        alt: 'Image with a post',
        title: 'Πρόγραμμα εξεταστικής περιόδου Ιανουαρίου 2021',
        description: 'Σας ενημερώνουμε ότι η ημερομηνία έναρξης της εξεταστικής περιόδου, στο ΠΜΣ “Πληροφοριακά ' +
            'Συστήματα” για το Β’ εξάμηνο, είναι η Δευτέρα 23 Ιανουαρίου 2021.',
        fullPost: 'Σας ενημερώνουμε ότι η ημερομηνία έναρξης της εξεταστικής περιόδου, στο ΠΜΣ “Πληροφοριακά ' +
            'Συστήματα” για το Β’ εξάμηνο, είναι η Δευτέρα 23 Ιανουαρίου 2021. Τα μαθήματα μέχρι νεωτέρας' +
            ' θα πραγματοποιούνται εξ αποστάσεως.'
    },
    {
        id: 'an4',
        img: an1Img,
        alt: 'Image with a post',
        title: 'Ανακοίνωση eclass',
        description: 'Απανεργοποίηση μη ενεργών λογαριασμών στο eclass για όλους τους φοιτητές οι οποίοι έχουν τελειώσει ' +
            ' επιτυχώς τις σπουδές τους για διάστημα μεγαλύτερο του ενός ακαδημαϊκού έτους',
        fullPost: 'Οι φοιτητές Α και Β κύκλων σπουδών που διαθέτουν παλαιό λογαριασμό στο σύστημα eclass.gr' +
            ' με σύνδεση με credentials απευθείας στην πλατφόρμα (και όχι ιδρυματικό λογαριασμό) ενημερώνονται ' +
            'ότι στις 3/6/2021 θα λήξει η ισχύς του λογαριασμού τους'
    },
    {
        id: 'an5',
        img: an1Img,
        alt: 'Image with a post',
        title: 'Πρόγραμμα εξεταστικής περιόδου Ιανουαρίου 2021',
        description: 'Σας ενημερώνουμε ότι η ημερομηνία έναρξης της εξεταστικής περιόδου, στο ΠΜΣ “Πληροφοριακά ' +
            'Συστήματα” για το Β’ εξάμηνο, είναι η Δευτέρα 23 Ιανουαρίου 2021.',
        fullPost: 'Σας ενημερώνουμε ότι η ημερομηνία έναρξης της εξεταστικής περιόδου, στο ΠΜΣ “Πληροφοριακά ' +
            'Συστήματα” για το Β’ εξάμηνο, είναι η Δευτέρα 23 Ιανουαρίου 2021. Τα μαθήματα μέχρι νεωτέρας' +
            ' θα πραγματοποιούνται εξ αποστάσεως.'
    },
    {
        id: 'an6',
        img: an1Img,
        alt: 'Image with a post',
        title: 'Ανακοίνωση eclass',
        description: 'Απανεργοποίηση μη ενεργών λογαριασμών στο eclass για όλους τους φοιτητές οι οποίοι έχουν τελειώσει ' +
            ' επιτυχώς τις σπουδές τους για διάστημα μεγαλύτερο του ενός ακαδημαϊκού έτους',
        fullPost: 'Οι φοιτητές Α και Β κύκλων σπουδών που διαθέτουν παλαιό λογαριασμό στο σύστημα eclass.gr' +
            ' με σύνδεση με credentials απευθείας στην πλατφόρμα (και όχι ιδρυματικό λογαριασμό) ενημερώνονται ' +
            'ότι στις 3/6/2021 θα λήξει η ισχύς του λογαριασμού τους'
    }
]

const reg = {
    title: 'Κανονισμός Σπουδών',
    article: 'Το ίδρυμα δημιουργήθηκε το έτος 1965 ενώ η διάρθρωσή του ...',
    link: '/regulation.pdf',
    linkDesc: 'Δείτε ολόκλρηρο τον Οδηγό Σπουδών 2020-21'
}

const workingStuff = [
    {
        id: 's1',
        type: 'professor',
        img: s1,
        alt: 'Εικόνα προφίλ του καθηγητή',
        firstName: 'Νίκος',
        lastName: 'Κορόμπος',
        role: 'Καθηγητής / Αναπληρωτής Καθηγητής',
        email: 's1_p@test.com',
        phone: '2101122333'
    },
    {
        id: 's2',
        type: 'professor',
        img: s2,
        alt: 'Εικόνα προφίλ του καθηγητή',
        firstName: 'Ευαγγελία',
        lastName: 'Καινούργιου',
        role: 'Καθηγητής / Αναπληρωτής Καθηγητής',
        email: 's2_p@test.com',
        phone: '2101122333'
    },
    {
        id: 's3',
        type: 'professor',
        img: s3,
        alt: 'Εικόνα προφίλ του καθηγητή',
        firstName: 'Λάμπρος',
        lastName: 'Σταυρινός',
        role: 'Καθηγητής',
        email: 's3_p@test.com',
        phone: '2101122333'
    },
    {
        id: 's4',
        type: 'professor',
        img: s4,
        alt: 'Εικόνα προφίλ του καθηγητή',
        firstName: 'Μάρκος',
        lastName: 'Γεωργίου',
        role: 'Καθηγητής / Αναπληρωτής Καθηγητής',
        email: 's4_p@test.com',
        phone: '2101122333'
    },
    {
        id: 's5',
        type: 'secretary',
        img: s5,
        alt: 'Εικόνα προφίλ του υπαλλήλου γραμματείας',
        firstName: 'Ιουλία',
        lastName: 'Εντζί',
        role: 'Καθηγητής / Αναπληρωτής Καθηγητής',
        email: 's5_s@test.com',
        phone: '2101122333'
    },
    {
        id: 's6',
        type: 'secretary',
        img: s6,
        alt: 'Εικόνα προφίλ του υπαλλήλου γραμματείας',
        firstName: 'Νικόλαος',
        lastName: 'Τσέλιος',
        role: 'Καθηγητής / Αναπληρωτής Καθηγητής',
        email: 's6_s@test.com',
        phone: '2101122333'
    }
]

const coursesList = {
    headers: [
        {
            id: 'time',
            name: 'Εξάμηνο'
        },
        {
            id: 'course',
            name: 'Μάθημα'
        },
        {
            id: 'teacher',
            name: 'Διδάσκων'
        },
        {
            id: 'units',
            name: 'Διδακτικές Μονάδες'
        },
        {
            id: 'type',
            name: 'Είδος'
        }
    ],
    courses: [
        {
            id: 'c1',
            time: 1,
            name: 'Η γλώσσα προγραμματισμού Java',
            teacher: 'Μάρκος Γεωργίου',
            units: 5,
            type: 'Βασικό'
        },
        {
            id: 'c2',
            time: 1,
            name: 'Σχεσιακές Βάσεις Δεδομένων',
            teacher: 'Λάμπρος Σταυρινός',
            units: 5,
            type: 'Βασικό'
        },
        {
            id: 'c3',
            time: 1,
            name: 'Κατασκευή Πληροφοριακών Συστημάτω ',
            teacher: 'Ευαγγελία Καινούργιου',
            units: 5,
            type: 'Βασικό'
        },
        {
            id: 'c4',
            time: 1,
            name: 'Διαχείριση επιχειρισιακών διεργασιών',
            teacher: 'Νίκος Κορόμπος',
            units: 5,
            type: 'Βασικό'
        },
        {
            id: 'c5',
            time: 2,
            name: 'Η γλώσσα προγραμματισμού Python',
            teacher: 'Λάμπρος Σταυρινός',
            units: 5,
            type: 'Βασικό'
        },
        {
            id: 'c6',
            time: 2,
            name: 'Αποθήκες Δεδομένων',
            teacher: 'Μάρκος Γεωργίου',
            units: 5,
            type: 'Βασικό'
        },
        {
            id: 'c7',
            time: 2,
            name: 'Μεγάλα Δεδομένα και Αναλυτική',
            teacher: 'Νίκος Κορόμπος',
            units: 5,
            type: 'Βασικό'
        },
        {
            id: 'c8',
            time: 2,
            name: 'Ευφυή Πληροφοριακά Συστήματα',
            teacher: 'Ευαγγελία Καινούργιου',
            units: 5,
            type: 'Βασικό'
        },
        {
            id: 'c9',
            time: 3,
            name: 'Η γλώσσα προγραμματισμού JavaScript',
            teacher: 'Λάμπρος Σταυρινός',
            units: 5,
            type: 'Βασικό'
        },
        {
            id: 'c10',
            time: 3,
            name: 'Μη Σχεσιακές Βάσεις Δεδομένων',
            teacher: 'Ευαγγελία Καινούργιου',
            units: 5,
            type: 'Βασικό'
        },
        {
            id: 'c11',
            time: 3,
            name: 'Λειτουργικά Συστήματα',
            teacher: 'Μάρκος Γεωργίου',
            units: 5,
            type: 'Επιλογής'
        },
        {
            id: 'c12',
            time: 3,
            name: 'Ασφάλεια Πληροφοριακών Συστημάτων',
            teacher: 'Νίκος Κορόμπος',
            units: 5,
            type: 'Επιλογής'
        }
    ]
}

export  { staticContent, terms, announce, reg, workingStuff, coursesList };